---
kind: other
id: Methods.T:Autodesk.Revit.DB.BasePoint
source: html/b41321b1-0e29-86c4-cbaf-ebdb87189985.htm
---
# BasePoint Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.